Revit 2027 API
SpatialFieldManager.LegendTextTypeId Property
 Stores element id of text associated with common (result-independent) part of legend in view.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId LegendTextTypeId { get; set; }
Public Property LegendTextTypeId As ElementId
	Get
	Set
public:
property ElementId^ LegendTextTypeId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member LegendTextTypeId : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
SpatialFieldManager Class
Autodesk.Revit.DB.Analysis Namespace